Code2char=" ,./:;abcdefghijklmnopqrstuvwxyz";
Tbl = new Array(
" ///////////////////////////////",// _0
",個視練/状倉永栄市可文村/険省路印//撃将統石朝格旅玉県尾/敷",//,_1
".巻彼況/即菱秋庫支室沢古/構型装敗//司械秀休農吉仲曜築竹/融",//._2
"／雨才景/辺浴陸波森渋馬袋/郵故働授//居護油豊億齢極環角泉/浦",///_3
"////////////////////////////////",//:_4
"’低例図/究賞芸江不北歩教/技号係側//段巨清原商近容宝佐坂/履",//;_5
"‘権申確/歌深/賃約天直/ゑゐをわ/写助期続悪寮毎/目/根族書星",//a_6
"←言張過/派未/史花率介/多意強実思再消身感始便挙/切/迎響別宇",//b_7
"○説席提/義児/守改補防/戦対当委党流愛演応静施貸/調/何登私渡",//c_8
"、売打考/長勤/独全各保/てちとた/作話人定早平他/つ/無堂会街",//d_9
"ー開指死/合残/免数結公/けきこか/談治者議両信団/く/待諸子母",//e_10
"。店価望/方増/観自関世/ねにのなん交語員女糸音米/ぬ/案兵上鈴",//f_11
"『男込規/政習/変住運現/れりろら社重点生成試計利/る/額監通帝",//g_12
"』含比準/位藤軍南東高新円/連力化夜//由級松山代名製横動浜/精",//h_13
"…航払材/劇島職映大万中分/夫画校題//番首洋京前区楽制務階/鋼",//i_14
"々聞止難/在付土谷二国年四/車験下物//局課安電月部種台川戸/友",//j_15
"※件審裁/式経神道日三一十/以間回所//体育都五田業用橋給料/収",//k_16
"＼師殺適/済正造共時八同面/完設歴際//薬色与小後問界武木火/寺",//l_17
"×害量督/塁葉城条海宿郎宅/断様値編//養担越岡卒門之幸蔵塚/鉱",//m_18
"→署華厚/末研岩草急崎光次/然良論般//字閣河半丸林庁芝元津/振",//n_19
"・寄顔差/親士雄阪六建九立/加心銀告//常毛船理百西園証駅労/停",//o_20
"”満普洗/爆坪春昇株鉄午外/能販転勢//領券久営接富終浅頭板/州",//p_21
"“使左展/空念/曇黒青警/主相よや/講必解配並整税/ゆ/伝祭食返",//q_22
"【決向輸/家赤/茶品優細/えいおあ/協先手特乗報参/う/白修出熱",//r_23
"☆選風足/明管/晴有今送/せしそさ/募性発総病広福/す/仕従場許",//s_24
"「美放味/集形/昨座最費/へひほは/反初的法専太基/ふ/港版行退",//t_25
"】飛陽善/衛井宮屋本地事千/表氏度英//院等口七野和及池産週/服",//u_26
"÷婦録答/査志/程役軽素/組要来入受検着術買財帰追/知/積冷取効",//v_27
"〒真算得/線右/注資活託/めみもま見府官気予態少質/む/健訪持競",//w_28
"§命導声/争示/御庭非具/投進備記引想認求限羽遊単/館/短徳情推",//x_29
"」隊減丁/王遇昭科学金工内/民勝歳紙//球果興町機第割央水伊/企",//y_30
"〆起抜違/置奏/酒評類討/判器策若任失負読達伸復医/好/裏刊落雑",//z_31
"//////扶畔壊端鶴季荻/////////呂燃囲診/拍殿喧/殻",//,h_32
"．/////盆蔑塾据腹繰碁/////////酌衡閥拙/孟蚊秦/宍",//,m_33
"//////喝姦藻諭暇殖粒/////////聡恭坐崩/禄稼茨/讃",//,n_34
"//////尋肯砕緊霧仁吸/////////慕肩随顧/伍乙侯/詫",//,y_35
"//////吏鉢頑肥珍斎陳/////////馳暦穀蒸/矩虜芯/賎",//.h_36
"//////萌薮帖叙云妃愉/////////牡箇蔭釦/戚允苛/諜",//.m_37
"//////諺姐櫛淋渇丑峻/////////烹惇抹汎/迄苔弛/兎",//.n_38
"//////鯛燭韓宴紺眺逐/////////蜂悠禍窃/頚悔桧/覗",//.y_39
"//////或咽且己旋巳巧/////////褐偵謀篤/敦堤銚/醍",///h_40
"//////仔凌剥駿畿匁姑/////////獅塵倭瓜/醐溺箕/脆",///m_41
"//////烏劫椀餓琢爾褒/////////縞枠龍牝/碍娼葛/叶",///n_42
"//////璃狸蝕逸逓慈枯/////////曙弧塊卑/畠晃斑/恕",///y_43
"♪/////預丈硬債忠汽塩/////////窯遺柳礎/豚葬酢/漸",//;h_44
"//////渥廓肇獣劣溜浸/////////萩噴瞳盲/斡爵挨/匙",//;m_45
"//////拭堺嚇紛酔寒瓦/////////馨唆膨沸/寅賠隙/詮",//;n_46
"//////冒偏斉柄卸甲避/////////尻駒輝那/栽敏碑/該",//;y_47
"/梢叡樫/墳///////騎袖猛弊衰耶柵巾渚////如///盾/",//ab_48
"−奪滋愚/虫蟲//////倒牛維拡禁隻淑弥添////痛///納/",//ag_49
"//////////////炒/ゎ憐姪/捗/靡鬱蝉譚う゛/////",//al_50
"/禅鳩遵/旨///////翼滝折恋照漠唇怪鶏////皆///縄/",//at_51
"/弐洛祇/蓋///////滑冠誰抱拾牙豹寂楠樟///賜///尉/",//av_52
"↓尤耽饗/牟///////晋毅梓婆麿伽膿榎乎////罷///柴/",//bb_53
"/帥幌燐/疎///////桐抵唯到喪紘楓尽詠////恩///奴/",//bg_54
"/盃禿逗/坦///////糾刈嗣朱崇椿斧斥汝////泌///眉/",//bt_55
"/蜜鎚汀/凸///////灰享酬狩隷埼慾貰嶋////藩///抄/",//bv_56
"/塑淀狽/稽///////虚貼撤頁睡遼厭缶栓////峠///鈍/",//cb_57
"/麗耗凹/艦///////銭雲里渉徹透謄啓斗////俊///浩/",//cg_58
"/酪慧糊/覆///////閉硫旗廃剣擦紐傑垂////掘///懸/",//ct_59
"●勺湘蛾/腫///////釜伯孤称溶妄榊逢遮////購///鍵/",//cv_60
"/升礁卯/索///////刑迫揮影刻偽椅芳曽////緑///漫/",//db_61
"，乳亡控/異///////婚夏幹供節存箱域幡////周///奥/",//dg_62
"/////////////でぢどだ//////づ//っ/////",//dl_63
"/皮舟柱/脱///////恵固岸客漁畑網綿勉////副///歓/",//dt_64
"/雇后駈/厘///////駐頼礼倍兄宛摂桑悟////隆///辰/",//dv_65
"/廻圭宋/揺///////冊菌晩射髪丙頬賄漬////滞///拝/",//eb_66
"/綱胃唄/紅///////肉盛丘杉帯黄侵弁宗////績///炭/",//eg_67
"/////////ヵ//ヶげぎごが/////////ぐ/////",//el_68
"＝略是削/脳///////走令妻革属患威隣厳////秘///訳/",//et_69
"/魂惟鞍/羊///////泰墨聴乃戒菩銑潔暫////畜///篇/",//ev_70
"/刀雌靖/廷///////宏娘傾欲誤廉尺鍛洞////腕///敬/",//fb_71
"．看敵鉛/努///////絶援舎圧焼菓鴨君震////荒///又/",//fg_72
"/鳴妙粋/唱///////均堀譲除桜浪虎則充////幅///催/",//ft_73
"/窮洪臆/筒///////摘峰犬鎌陰迭煩勲峡////沿///祖/",//fv_74
"/蹟諏迦/濁///////笠貝銅胸脅溝芙怠翁////脇///唐/",//gb_75
"⇔腰凡懲/困///////障盟瀬繊移弦慢幕灯////錠///筆/",//gg_76
"/微祈遷/毒///////列創魚典宣黙惜踊緒////遅///需/",//gt_77
"/晶宰癒/叫///////濃祝暖珠杯累桶携斐////魔///彫/",//gv_78
"■/////兼抽脂責須依盗/////////寝操飯招/鏡就梶/胎",//hh_79
"//////苑嘱狼還淡堅悩/////////斜佳揚挑/愁炎拷/蓉",//hm_80
"//////旺蕗叱寛縦眠奨/////////斤涼隔奮/昆嶺勾/嵯",//hn_81
"//////掲綾畳湯湖呼絡/////////匹仙薄描/桃皇哀/燈",//hy_82
"//////刷雅逃突彦糖干/////////陣押房核/混余亭/抑",//ih_83
"//////幾呑軌桂衝弟棄/////////顕妹芦搭/繭遭磯/怨",//im_84
"//////輩醜伺徴銃逮忍/////////軸砲沈拒/恨狭茎/勃",//in_85
"▼/////貨栗症模易希邸/////////僚鳥郡枚/拠粉腸/戯",//iy_86
"□/////因賦儀康布紡識/////////扱温象血/飲父至/尊",//jh_87
"//////胴惰虐悲誇献童/////////枕裳卓粛/殴庶哉/朔",//jm_88
"//////蝶冗皿暮騒亀絵/////////憶肌奉蓄/矛卵蛮/遥",//jn_89
"//////岳伎項闘採疑仏/////////旬離秒功/吾飾怒/仰",//jy_90
"◆/////筋致喫針舞徒喜/////////豪密系遠/欧謡宙/零",//kh_91
"//////菅蘭涙危被乞替/////////誕縮載吹/握序俺/茜",//km_92
"//////床隈励片辞弱勇/////////嘉牧浮勧/惨仮憤/劾",//kn_93
"//////寿疲硝邦境衆姿/////////潟借攻夕/臣博染/較",//ky_94
"◇/////湾姉謝締破換犯/////////眼舗傷豆/穴災糧/赴",//lh_95
"//////尿殉訟躍貫欠栃/////////猟嵐懇貞/租帽儒/謎",//lm_96
"//////庸覇衷律壁襲釣/////////妓炊憂蓮/襟屈妖/鹸",//ln_97
"//////獄悦暑酸併札丹/////////扇執像菊/泥届於/仇",//ly_98
"//////刃陵痢包昌息踏/////////掌訓呉穂/翻捨伐/羅",//mh_99
"∞/////篠屍餅朴癖縛戴/////////碇鈎鮎鯉/蝿頻檀/硯",//mm_100
"//////屯糞琵苗践棚艶/////////阜狗膜赦/蛙粍凧/桓",//mn_101
"//////篭挺旦乾遣秩頂/////////跳欄壮薩/曲拘玲/此",//my_102
"//////偶塀絞泳撮籍撲/////////叉陛阻其/冴擁玩/卦",//nh_103
"//////酉杖迂詐燥脈狙/////////妾蚕湧繍/鮭吊歎/潰",//nm_104
"⇒/////罫鷲溢衿亨絢瑞/////////勿彬岬畏/腺頓竪/鵬",//nn_105
"//////猪蟹佃艇猶暁賊/////////臼鼓吟枢/曳洩憧/塞",//ny_106
"//////棒僧孫互樹竜夢/////////緩梅塗了/征封涯/弔",//oh_107
"//////蹴甫呆磨岐柔腐/////////倣縁湿蛇/笹賭麓/肘",//om_108
"//////惣箔釘誉泡貌諾/////////喉窟堕郭/麺嬉詣/珊",//on_109
"▽/////鋭詞鼻票章背刺/////////耳呈貴巡/滅貯斬/霞",//oy_110
"//////触机閑著鮮絹複/////////妥冬措裕/妨促幣/拐",//ph_111
"//////腎吠汲嘩蒼壷糎/////////痔廿壱肢/俄朋蛋/俣",//pm_112
"//////梨膝樽款錯邪剖/////////飴帆飢撒/稜蛍柑/堆",//pn_113
"∇/////潤懐但途超沼束/////////傍曹幼飼/疾我慨/挿",//py_114
"/夷綻弄/咳///////葦悼芋鍋胤謬灼睦樺////葵///璽/",//qb_115
"/怖餌隼/靴///////尚蒲詩快骨符喰誘匠////錦///哲/",//qg_116
"//////αβκδεφγηιょゃλμνοπθρστゅυωχψζ",//ql_117
"≡胆飽筑/寸///////範魅救継詰娠奔嫁嘆////忘///智/",//qt_118
"/灸麹倦/呪///////繕嫌雰胞杏燕肋輔苫////訊///桟/",//qv_119
"/舌亮諦/憾///////紋伏潜臓駆匡暢鯨凄////烈///弓/",//rb_120
"/贈聖罰/窓///////衣激散捕捜脚墓歯鬼////昼///稲/",//rg_121
"/////////////ぇぃぉぁ/////////ぅ/////",//rl_122
"≠克択孔/跡///////香測処請抗句耐慶惑////雪///源/",//rt_123
"/穣痕凪/棺///////搬披祉瞬宵濫狐肪壌////没///猿/",//rv_124
"/頒唾奄/辛///////稿酵彰熟浄欣虹剰慌////耕///猫/",//sb_125
"★露壇倫/菜///////笑織盤降底俳麦承却////順///郷/",//sg_126
"/////////////ぜじぞざ/////////ず/////",//sl_127
"/郊薫墾/凍///////占鹿誌療銘鎖嬢焦譜////矢///探/",//st_128
"/架馴亘/俵///////詳粧戻更薦陥漏霊濯////犠///軟/",//sv_129
"/柏牌贋/只///////吐筈乏准姓煎冥寡癌////賓///匂/",//tb_130
"/獲僕臥/掛///////繁批願貿逆慰粗祥慣////熊///為/",//tg_131
"/////////ぱぴぽぺべびぼば//////ぷ//ぶ/////",//tl_132
"↑謹凶巌/狂///////層朗留亜伴笛侍既憩////紳///恐/",//tt_133
"/姻諒舘/轄///////迷舶琴縫雷喬脹括疫////裂///析/",//tv_134
"//////阿驚排賀延純奈/////////孝標乱旧/潮償拓/牲",//uh_135
"//////崖蘇錘忙圏訂欺/////////薪幻妊芽/藍坑鳳/雫",//um_136
"//////棟悌虞趣往泣兆/////////噂騰汗咲/尭循怜/裟",//un_137
"△/////賛昔煙苦去察速/////////鑑益暴訴/慎茂姫/綜",//uy_138
"/牢槻竿/痘///////穫播徐李辱楚采嘘冨////剛///醤/",//vb_139
"/拳侮祐/概///////帳也掃簡汚囚漆恒媒////契///液/",//vg_140
"/昂瑠粕/甚///////煮謙泊甘澄挟朕錬叔////彩///臭/",//vt_141
"◎魁卿曾/庵///////凝遍厄憎旭芭撫緋舵////裾///渓/",//vv_142
"/淫碓捺/嵩///////某滴庄諮胡賑叩恰甥////忌///尼/",//wb_143
"/埋穏傘/奇///////憲候沖麻荘廊窒剤淵////罪///弾/",//wg_144
"≒貧楼韻/軒///////紹述臨砂双揃痴損釈////覚///誠/",//wt_145
"/濡昏灘/幽///////似班辻覧汁搾碧匿殆////漂///頃/",//wv_146
"/噌苅屑/汰///////紗瑛沙僅亦蓬蕉粟鼠////塔///柿/",//xb_147
"/剃釧槍/肖///////墜鋳翌坊召欽把瓶寧////肝///堪/",//xg_148
"/爪脊稀/逝///////酷誓隠賢恥羨蟻倹窪////骸///朽/",//xt_149
"±閃腿壬/俸///////閲娯附径喚雁峯郁箸////綴///闇/",//xv_150
"//////淳炉垣紀弘輪老/////////函巣慮摩/遂殊偉/迅",//yh_151
"//////緯蔦爺鐘棋鷹簿/////////股漢俗紫/矯裸伶/芹",//ym_152
"//////嫡鴎洲巴隅肺敢/////////歪扉婿膳/萎謁峨/鋸",//yn_153
"▲/////稚膚駄群植否荷/////////玄枝陶暗/鎮氷擬/橘",//yy_154
"/酋醒鞭/註///////串槙禎渦琶屠堰楯椎////瞭///舷/",//zb_155
"/鍾拶樋/陪///////雀醸勘距磁佑芥丞詔////貢///培/",//zg_156
"/尖茅漕/鞄///////勅宜霜槽粘倶兜畝莫////髄///亥/",//zt_157
"＋悶蕪袴/潅///////梱桁稔汐凱茸遡髭蒙////杜///砦/",//zv_158
"");
TblTable = new Array;
TblTable[',h']=32;
TblTable[',m']=33;
TblTable[',n']=34;
TblTable[',y']=35;
TblTable['.h']=36;
TblTable['.m']=37;
TblTable['.n']=38;
TblTable['.y']=39;
TblTable['/h']=40;
TblTable['/m']=41;
TblTable['/n']=42;
TblTable['/y']=43;
TblTable[';h']=44;
TblTable[';m']=45;
TblTable[';n']=46;
TblTable[';y']=47;
TblTable['ab']=48;
TblTable['ag']=49;
TblTable['al']=50;
TblTable['at']=51;
TblTable['av']=52;
TblTable['bb']=53;
TblTable['bg']=54;
TblTable['bt']=55;
TblTable['bv']=56;
TblTable['cb']=57;
TblTable['cg']=58;
TblTable['ct']=59;
TblTable['cv']=60;
TblTable['db']=61;
TblTable['dg']=62;
TblTable['dl']=63;
TblTable['dt']=64;
TblTable['dv']=65;
TblTable['eb']=66;
TblTable['eg']=67;
TblTable['el']=68;
TblTable['et']=69;
TblTable['ev']=70;
TblTable['fb']=71;
TblTable['fg']=72;
TblTable['ft']=73;
TblTable['fv']=74;
TblTable['gb']=75;
TblTable['gg']=76;
TblTable['gt']=77;
TblTable['gv']=78;
TblTable['hh']=79;
TblTable['hm']=80;
TblTable['hn']=81;
TblTable['hy']=82;
TblTable['ih']=83;
TblTable['im']=84;
TblTable['in']=85;
TblTable['iy']=86;
TblTable['jh']=87;
TblTable['jm']=88;
TblTable['jn']=89;
TblTable['jy']=90;
TblTable['kh']=91;
TblTable['km']=92;
TblTable['kn']=93;
TblTable['ky']=94;
TblTable['lh']=95;
TblTable['lm']=96;
TblTable['ln']=97;
TblTable['ly']=98;
TblTable['mh']=99;
TblTable['mm']=100;
TblTable['mn']=101;
TblTable['my']=102;
TblTable['nh']=103;
TblTable['nm']=104;
TblTable['nn']=105;
TblTable['ny']=106;
TblTable['oh']=107;
TblTable['om']=108;
TblTable['on']=109;
TblTable['oy']=110;
TblTable['ph']=111;
TblTable['pm']=112;
TblTable['pn']=113;
TblTable['py']=114;
TblTable['qb']=115;
TblTable['qg']=116;
TblTable['ql']=117;
TblTable['qt']=118;
TblTable['qv']=119;
TblTable['rb']=120;
TblTable['rg']=121;
TblTable['rl']=122;
TblTable['rt']=123;
TblTable['rv']=124;
TblTable['sb']=125;
TblTable['sg']=126;
TblTable['sl']=127;
TblTable['st']=128;
TblTable['sv']=129;
TblTable['tb']=130;
TblTable['tg']=131;
TblTable['tl']=132;
TblTable['tt']=133;
TblTable['tv']=134;
TblTable['uh']=135;
TblTable['um']=136;
TblTable['un']=137;
TblTable['uy']=138;
TblTable['vb']=139;
TblTable['vg']=140;
TblTable['vt']=141;
TblTable['vv']=142;
TblTable['wb']=143;
TblTable['wg']=144;
TblTable['wt']=145;
TblTable['wv']=146;
TblTable['xb']=147;
TblTable['xg']=148;
TblTable['xt']=149;
TblTable['xv']=150;
TblTable['yh']=151;
TblTable['ym']=152;
TblTable['yn']=153;
TblTable['yy']=154;
TblTable['zb']=155;
TblTable['zg']=156;
TblTable['zt']=157;
TblTable['zv']=158;

function next_offset(t, n)
{
  if (t == 0) {
    return n*32;
  } 
}
function code2n(code2)
{// とりあえず 0〜31 を予約 
	if (code2 < 39) {
	    if (code2 == 32) { return 0; }// space
		return 95; // "_"
	} else if (code2 < 65) {
		return code2;
	} else if (code2 < 91) {
		return code2 - 59;
	} else if (code2 < 186) {
		return code2;
	} else if (code2 <= 192) {
		if (code2 == 188) { return 1; }//,
		if (code2 == 190) { return 2; }//.
		if (code2 == 191) { return 3; }//slash(/)
		if (code2 == 186) { return 4; }//:
		if (code2 == 187) { return 5; }//;
	}
	return code2;
}
function Tut()
{
    this.buf = '';
	this.tbl = 0; // 現在使用しているテーブル番号 
	this.stroke = 0; // 現在バッファにたまっているキーストローク数
	this.feed = function(code) {
		let n = code2n(code);
        //console.log("Code: ", code, " ", n);
        if (code == 8) { // BackSpaceを「前文字消し」として特別扱い
            if (this.buf.length == 0) {
                return '^H';
            } else {
                this.stroke--;
                this.buf = this.buf.replace(/.$/,"") // JavaScriptのchop!に該当する関数がわからない…
                if (this.stroke == 0) {
		            this.tbl = n;
		        } else {
		            this.tbl = TblTable[this.buf];
		        }
                return '';
            }
        } else if (code == 27) { // Ctrl+G ESCAPE バッファクリアの特別扱い
            if (this.buf.length == 0) {
                return '^G';
            } else {
                this.tbl = this.stroke = 0;this.buf = '';
                return '';
            }
        } else if (code < 32) {
            return '';
        }
		let c = Tbl[this.tbl].charAt(n);
		if (c == '/') {
		    this.buf += Code2char.charAt(n);
		    if (this.stroke == 0) {
		        this.tbl = n;
		    } else {
		        this.tbl = TblTable[this.buf];
		    }
		    if (++this.stroke > 2) {
		        this.tbl = this.stroke = 0;this.buf = '';
		    }
		    return '';
		} else {
		  this.tbl = this.stroke = 0;this.buf = '';
		  return c;
		}
	}
    return this;
}
